fireFoam/testBatteryFireFOAM/coFlowFlameSpray2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet
    {
        type            calculated;
        value           $internalField;
    }

    sides
    {
        type            calculated;
        value           $internalField;
    }
    base
    {
        type            calculated;
        value           $internalField;
    }
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
